{"format": "graph-model", "generatedBy": "2.2.0", "convertedBy": "TensorFlow.js Converter v1.7.4r1", "userDefinedMetadata": {"signature": {"inputs": {"conv1_input:0": {"name": "conv1_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}}, "outputs": {"Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "13"}]}}, "Identity_2:0": {"name": "Identity_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "13"}]}}, "Identity_3:0": {"name": "Identity_3:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "13"}]}}, "Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "13"}]}}}}}, "modelTopology": {"node": [{"name": "conv1_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}}}, {"name": "Func/StatefulPartitionedCall/input/_40", "op": "Const", "input": ["^conv1_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "13"}, {"size": "13"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_2", "op": "Const", "input": ["^conv1_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_3", "op": "Const", "input": ["^conv1_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_8", "op": "Const", "input": ["^conv1_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "50"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_9", "op": "Const", "input": ["^conv1_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_14", "op": "Const", "input": ["^conv1_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "50"}, {"size": "100"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization_1/FusedBatchNormV3/Offset", "op": "Const", "input": ["^conv1_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_15", "op": "Const", "input": ["^conv1_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_20", "op": "Const", "input": ["^conv1_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "100"}, {"size": "200"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_21", "op": "Const", "input": ["^conv1_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_26", "op": "Const", "input": ["^conv1_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "200"}, {"size": "200"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_27", "op": "Const", "input": ["^conv1_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}]}}}}}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^conv1_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_32", "op": "Const", "input": ["^conv1_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}, {"size": "200"}, {"size": "200"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_33", "op": "Const", "input": ["^conv1_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_38", "op": "Const", "input": ["^conv1_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "200"}, {"size": "13"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization/FusedBatchNormV3/Offset", "op": "Const", "input": ["^conv1_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_39", "op": "Const", "input": ["^conv1_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "13"}]}}}}}, {"name": "StatefulPartitionedCall/model/GAP/Mean/reduction_indices", "op": "Const", "input": ["^conv1_input"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization_5/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^conv1_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization_5/FusedBatchNormV3/Offset", "op": "Const", "input": ["^conv1_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}]}}}}}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization_4/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^conv1_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization_4/FusedBatchNormV3/Offset", "op": "Const", "input": ["^conv1_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization_3/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^conv1_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization_3/FusedBatchNormV3/Offset", "op": "Const", "input": ["^conv1_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization_2/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^conv1_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization_2/FusedBatchNormV3/Offset", "op": "Const", "input": ["^conv1_input"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization_1/FusedBatchNormV3/Scaled", "op": "Const", "input": ["^conv1_input"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}}}, {"name": "StatefulPartitionedCall/model/cam/conv1/BiasAdd", "op": "_FusedConv2D", "input": ["conv1_input", "Func/StatefulPartitionedCall/input/_2", "Func/StatefulPartitionedCall/input/_3"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/model/cam/max_pooling2d/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/model/cam/conv1/BiasAdd"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/model/cam/re_lu/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/cam/max_pooling2d/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/cam/batch_normalization/FusedBatchNormV3/Scaled", "StatefulPartitionedCall/model/cam/re_lu/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model/cam/batch_normalization/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/cam/batch_normalization/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/cam/conv2/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/cam/batch_normalization/FusedBatchNormV3", "Func/StatefulPartitionedCall/input/_8", "Func/StatefulPartitionedCall/input/_9"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model/cam/max_pooling2d_1/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/model/cam/conv2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/model/cam/re_lu_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/cam/max_pooling2d_1/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization_1/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/cam/batch_normalization_1/FusedBatchNormV3/Scaled", "StatefulPartitionedCall/model/cam/re_lu_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization_1/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model/cam/batch_normalization_1/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/cam/batch_normalization_1/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/cam/conv3/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/cam/batch_normalization_1/FusedBatchNormV3", "Func/StatefulPartitionedCall/input/_14", "Func/StatefulPartitionedCall/input/_15"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model/cam/max_pooling2d_2/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/model/cam/conv3/BiasAdd"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/cam/re_lu_2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/cam/max_pooling2d_2/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization_2/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/cam/batch_normalization_2/FusedBatchNormV3/Scaled", "StatefulPartitionedCall/model/cam/re_lu_2/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization_2/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model/cam/batch_normalization_2/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/cam/batch_normalization_2/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/cam/re_lu_3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/cam/batch_normalization_2/FusedBatchNormV3", "Func/StatefulPartitionedCall/input/_20", "Func/StatefulPartitionedCall/input/_21"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization_3/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/cam/batch_normalization_3/FusedBatchNormV3/Scaled", "StatefulPartitionedCall/model/cam/re_lu_3/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization_3/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model/cam/batch_normalization_3/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/cam/batch_normalization_3/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/cam/conv2d/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/cam/batch_normalization_3/FusedBatchNormV3", "Func/StatefulPartitionedCall/input/_26", "Func/StatefulPartitionedCall/input/_27"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/model/cam/leaky_re_lu/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model/cam/conv2d/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.3}}}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization_4/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/cam/batch_normalization_4/FusedBatchNormV3/Scaled", "StatefulPartitionedCall/model/cam/leaky_re_lu/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization_4/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model/cam/batch_normalization_4/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/cam/batch_normalization_4/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/cam/conv2d_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/cam/batch_normalization_4/FusedBatchNormV3", "Func/StatefulPartitionedCall/input/_32", "Func/StatefulPartitionedCall/input/_33"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model/cam/leaky_re_lu_1/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model/cam/conv2d_1/Relu"], "attr": {"alpha": {"f": 0.3}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization_5/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/cam/batch_normalization_5/FusedBatchNormV3/Scaled", "StatefulPartitionedCall/model/cam/leaky_re_lu_1/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization_5/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model/cam/batch_normalization_5/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/cam/batch_normalization_5/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/cam/CAM/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model/cam/batch_normalization_5/FusedBatchNormV3", "Func/StatefulPartitionedCall/input/_38", "Func/StatefulPartitionedCall/input/_39"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/model/cam/CAM/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/GAP/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model/cam/CAM/BiasAdd", "StatefulPartitionedCall/model/GAP/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model/GAP/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/identity/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/model/GAP/Mean", "Func/StatefulPartitionedCall/input/_40"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model/softmax_for_probabilities/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/model/GAP/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_2", "op": "Identity", "input": ["StatefulPartitionedCall/model/identity/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_3", "op": "Identity", "input": ["StatefulPartitionedCall/model/softmax_for_probabilities/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "versions": {"producer": 175}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "Func/StatefulPartitionedCall/input/_40", "shape": [13, 13], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_2", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_3", "shape": [32], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_8", "shape": [3, 3, 32, 50], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_9", "shape": [50], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_14", "shape": [3, 3, 50, 100], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization_1/FusedBatchNormV3/Offset", "shape": [50], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_15", "shape": [100], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_20", "shape": [1, 1, 100, 200], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_21", "shape": [200], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_26", "shape": [3, 3, 200, 200], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_27", "shape": [200], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization/FusedBatchNormV3/Scaled", "shape": [32], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_32", "shape": [2, 2, 200, 200], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_33", "shape": [200], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_38", "shape": [1, 1, 200, 13], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization/FusedBatchNormV3/Offset", "shape": [32], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_39", "shape": [13], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/GAP/Mean/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization_5/FusedBatchNormV3/Scaled", "shape": [200], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization_5/FusedBatchNormV3/Offset", "shape": [200], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization_4/FusedBatchNormV3/Scaled", "shape": [200], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization_4/FusedBatchNormV3/Offset", "shape": [200], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization_3/FusedBatchNormV3/Scaled", "shape": [200], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization_3/FusedBatchNormV3/Offset", "shape": [200], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization_2/FusedBatchNormV3/Scaled", "shape": [100], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization_2/FusedBatchNormV3/Offset", "shape": [100], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/cam/batch_normalization_1/FusedBatchNormV3/Scaled", "shape": [50], "dtype": "float32"}]}]}